OpenFOAM/mixerVesselAMI2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    FrontAndBack
    {
        type            empty;
        physicalType    empty;
        inGroups        1(empty);
        nFaces          69308;
        startFace       55201;
    }
    patch1
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       124509;
    }
    patch2
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       124607;
    }
    patch3
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       124705;
    }
    Shaft
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          18;
        startFace       124803;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       124821;
    }
    Lat-Wall
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       124900;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       124998;
    }
    AMI-St
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          119;
        startFace       125077;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI-Rt;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          119;
        startFace       125196;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI-St;
    }
)

// ************************************************************************* //
